/*
	ĞÕÃû:°¬×Î¶û½­¡¤°¬¶ûË¹À¼ 
	Ñ§ºÅ:17081160 
	×¨Òµ:Êı×ÖÃ½Ìå¼¼Êõ 
	Ê±¼ä: 10/12/18 20:07
	ÃèÊö:ÊµÑéÎåµÄµÚÒ»µÀÌâ 
*/

#include <iostream>
using namespace std;

int Search(int a[],const int low,const int high,int x)//ÊµÏÖÕÛ°ëËÑË÷µÄº¯Êı£¬º¯ÊıÄÚ´«ÈëËÄ¸ö±äÁ¿£		 
{
   int t=0;//½«×îºóÒªÇóµÃµÄÖµ½øĞĞ³õÊ¼»¯ 
   if(low<=high)//µ±×îºólow==highÊ±£¬±íÊ¾ËÑË÷³É¹¦£¬·µ»Øt£¬Èç¹ûÎ´ÕÒµ½Ôò·µ»Øt=0
   {
    	t=(low+high)/2;//½«ÔËËãºóµÄÖµ¸³¸øt 
    	if(a[t]<x)          {t=Search(a,t+1,high,x);}//Èç¹ûÊı×éÖĞµÄÊıÖµĞ¡ÓÚx£¬ÔòÏòºó½øĞĞ²éÕÒ 
    	else if(a[t]>x)     t=Search(a,low,t-1,x);//Èç¹ûÊı×éÖĞµÄÊıÖµ´óÓÚx£¬ÔòÏòÇ°½øĞĞ²éÕÒ 
   }
   return t;//·µ»Øt
}

int main()
{
	int b;//ÉùÃ÷×î´óÈİÁ¿
	cout<<"ÇëÊäÈë±íµÄÈİÁ¿£º"<<endl; 
	cin>>b;//ÓÃ»§ÊäÈë×î´óÈİÁ¿ 
	int *Maxsize=new int[b];//ÉùÃ÷¶¯Ì¬Êı×é£¬ÈÃÓÃ»§ÊäÈëÊı×éÖĞµÄÊı¾İ 
	for(int i=0;i<b;i++)//¸ù¾İÓÃ»§×Ô¼º¸ø¶¨µÄÈİÁ¿£¬ÓÃ»§ÏàÓ¦µØÊäÈëÊı×éÖĞµÄÊı¾İ 
	{
		cout<<"ÇëÊäÈëµÚ"<<i+1<<"¸öÎ»ÖÃ´¦µÄÊı×Ö£º"<<endl;//ÌáÊ¾ÓÃ»§ÊäÈëÊı¾İ 
		cin>>Maxsize[i];//ÓÃ»§ÊäÈëÊı×éÖĞ¸ö¸÷¸öÊı¾İ 
	}
    int x;//ÉùÃ÷Î´ÖªÕûĞÍ±äÁ¿£¬ÓÃÓÚÓÃ»§ÊäÈëĞèÒª²éÕÒµÄÊı¾İ
	cout<<endl; 
	cout<<"ÊäÈëÒª²éÕÒµÄÊı×Ö:";
 	cin>>x;//ÓÃ»§ÊäÈëĞèÒª²éÕÒµÄÊı¾İ 
 	int k=Search(Maxsize,0,b,x);//½«ÓÃ»§ËùÊäÈëµÄÊı¾İ´«µ½ËÑË÷º¯ÊıÖĞ²¢½«ËÑË÷º¯ÊıËùµÃµ½µÄ·µ»ØÖµ¸³¸øk 
 	if(k==0) cout<<"Êı¾İÖĞ²»´æÔÚÔªËØ"<<x<<"!ÇëÖØĞÂÊäÈëÓûËÑË÷µÄÊı¾İ£¡"<<endl;
	 //Îª±ãÓÚº¯Êı½øĞĞÏàÓ¦µÄÅĞ¶Ï£¬ÈôK ÊÇ0£¬¾İÇ°ËùÊöÎ´²éµ½ 
 	else//Èôµ«»áÖµµÄ²»ÊÇ0£¬Ôò³ÊÏÖÓÃ»§¸ÃÔªËØËù´¦µÄ¾ßÌåÎ»ÖÃ 
 	cout<<x<<"µÄÎ»ÖÃÔÚË³Ğò±íµÄµÚ"<<k+1<<"´¦¡£"<<endl;
}


